class Main {
    public static void main(String[] args) {
        //4893520617 = String
        //1) String тін index тер саны "Kazakhstan" созінің ұзындығына тең екенін дәлелдеу керек
        //2) String  тағы 0 2 8 9 символдарын жою керек
        //3)Қалған символдарды жеке жеке сандарға айналдыру керек
        //4)Шыққан сандардың index теріне тең символдарды жеке жеке шығару керек   (осы сөзден"Kazakhstan") charAt Метеды
        //5)Шыққан символдардан адамның есімін табу
        //6)(kz001ALI --> ALIAKPAR) деген сияқты kz,001 сөзерін жоғарыдағы String тардан кесіп аласыздар
        // ALI сөзі секелді шыққан адам атының алғашқы 3 әріпін осылай шығару
        // одан кейін --> белгісін қойып адамның атын толық,бас әріппен шығару
        // Жақша ішіндегі барлығы шығу керек
    }
}